app/controllers/accounts_controller.rb

  def index
    @accounts = current_user.accounts.all
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 1

  def new
    #generating created account ID
    if(Account.count > 0)
---
SELECT "accounts".* FROM "accounts"
SELECT COUNT(*) FROM "accounts"

  def edit
    @account = current_user.accounts.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 2 AND "accounts"."id" = ? LIMIT 1  [["id", "6"]]

  def create
    @acc = current_user.accounts.all
    account_name = params["name"]["Account Name"]
    account_type = params["account"]["account_type"]
    if (params[:name])
      #avoiding duplicate accounts
      if params[:name]["Account Name"] == ''
        redirect_to accounts_path
        flash[:notice] = "Name can not be empty"
      elsif (Account.duplicate?(params[:name]["Account Name"], current_user))
        redirect_to accounts_path
        flash[:notice] = "#{params[:name]["Account Name"]} is already a valid account please check it below"
      else
        total_amount = 0
        balance_type = current_user.accounts.acc_new(account_type)
        @account = current_user.accounts.create!({:account_name => account_name, :account_type => account_type, :total_amount => total_amount, :balance_type => balance_type})
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 4
INSERT INTO "accounts" ("account_name", "account_number", "account_type", "balance_type", "created_at", "total_amount", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @account.update_attributes(params[:account])
---
UPDATE "accounts" SET "account_name" = 'Any Expenses', "account_type" = 'Expense', "total_amount" = 0, "updated_at" = '2015-01-22 11:55:41.509009' WHERE "accounts"."id" = 10

    def set_account
      @account = current_user.accounts.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 1 AND "accounts"."id" = ? LIMIT 1  [["id", "5"]]
SELECT COUNT(*) FROM "accounts" WHERE "accounts"."user_id" = 4