app/controllers/transactions_controller.rb

  def index
    @transactions = current_user.transactions.all
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = 1

  def show

    from_account = Transaction.find_by_id(params[:id]).from_account.to_i
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 8 LIMIT 1
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @all_accounts = current_user.accounts.all
    #there should be at least two accounts to perform transactions
    if current_user.accounts.count < 2
      redirect_to transactions_path
      flash[:notice] = "There should be at least two accounts to perform transactions"
    else
      #getting ID of the transaction
      if Transaction.count ==0
        @trans_id = 1
      else
        @trans_id = Transaction.all.sort.last.id+1
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 4
SELECT COUNT(*) FROM "accounts" WHERE "accounts"."user_id" = 4
SELECT COUNT(*) FROM "transactions"
SELECT "transactions".* FROM "transactions"

  def create
    from_account = current_user.accounts.find_by_id(params[:transaction][:from_account].to_i)
    to_account   = current_user.accounts.find_by_id(params[:transaction][:to_account].to_i)
    amount       = params[:transaction][:amount].to_i
    balance      = current_user.accounts.balance(from_account, to_account, amount);
    if amount < 0
      flash[:notice] = "Amount has a negative sign and that's not allowed, please re-enter the amount"
      redirect_to new_transaction_path
    else
      if (balance == 0)
        ret_val = current_user.accounts.transaction_account(from_account, to_account, amount)
        if ret_val == ''
      	  @transaction = current_user.transactions.new(params[:transaction])
          @transaction.save
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 4 AND "accounts"."id" = 0 LIMIT 1
INSERT INTO "transactions" ("amount", "created_at", "description", "from_account", "to_account", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @transaction.destroy
---
DELETE FROM "transactions" WHERE "transactions"."id" = ?  [["id", 3]]

    def set_transaction
      @transaction = current_user.transactions.find(params[:id])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = 2 AND "transactions"."id" = ? LIMIT 1  [["id", "6"]]