app/views/transactions/index.html.erb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 4 AND "accounts"."id" = 18 LIMIT 1
---
  <tr>
    <td><%= current_user.accounts.find_by_id(transaction.from_account.to_i).account_name %></td>