app/views/transactions/new.html.erb

SELECT "accounts".* FROM "accounts"
SELECT COUNT(*) FROM "accounts"
---
    <% options = options_from_collection_for_select(@all_accounts, 'id', 'account_name') %>
    <%= f.select :from_account,  options %>