app/views/transactions/new.html.erb

SELECT "transactions".* FROM "transactions"
---

  <!--Transaction ID to be created: <% "#{Transaction.all.sort.last.id+1}" %>