app/views/accounts/new.html.erb

SELECT "accounts".* FROM "accounts"
SELECT COUNT(*) FROM "accounts"
---
  <!--<%= text_field :account, 'account_number' %></br> why account no and id?-->
  Account ID to be created: <%= "#{Account.all.sort.last.id+1}" %>