app/views/accounts/new.html.erb

SELECT "account_types".* FROM "account_types"
---
    <%= f.label :account_type_id, 'Account type' %>
    <%= f.collection_select(:account_type_id, AccountType.all, :id, :account_type) %>